// arr=['Рома', 'Катя', 'Илюша', 'получили', 'подарок', 'не']
// alert(arr[0] + arr[2] + arr[5] + arr[3] + arr[4])
// arr[7]= 'Максим'
// alert(arr[7] + arr[6] + arr[2] + arr[5] + arr[3] + arr[4])
// obj = {'Коля':'1000', 'Рома':'2000', 'Юля':'5000'}
// alert(obj['Рома'])
// arr={
//     'Юля':['3000', '32000', '40000'],
//     'Рома':['10','8','6']
// }
// alert(arr['Юля'][0])
// arr = {
//     'мальчики':['Артем', 'Максим', 'Тимофей', 'Илья', 'Рома'],
//     'девочки':['Вика', 'Юля', 'Саша', 'Соня', 'Катя']
// }
// alert(arr['мальчики'][0] + "   " + arr['девочки'][0])
arr = [2,3,4,5]
for(i=0;i<4;i++){
    a=1
    a=arr[i]*a
    alert(a)
}